TestPlans/Home/Home Protect/xml/HPT3_25112014_3.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tem="http://tempuri.org/" xmlns:web="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd">
  <soap:Body>
    <tem:GetQuote>
      <tem:userName>Compare the Market</tem:userName>
      <tem:passWord>1254CTM2014</tem:passWord>
      <tem:quotationDataXml>&lt;web:QuestionData xmlns:web="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;
  &lt;web:TitleID&gt;004&lt;/web:TitleID&gt;
  &lt;web:FirstName&gt;Charlotte&lt;/web:FirstName&gt;
  &lt;web:LastName&gt;Three&lt;/web:LastName&gt;
  &lt;web:DateOfBirth&gt;1962-04-17&lt;/web:DateOfBirth&gt;
  &lt;web:Sex&gt;F&lt;/web:Sex&gt;
  &lt;web:MaritalStatusID originalvalueid="Single"&gt;1&lt;/web:MaritalStatusID&gt;
  &lt;web:OccupationID originalvalueid="Child Minder"&gt;C14&lt;/web:OccupationID&gt;
  &lt;web:BusinessID originalvalueid="Child Minding"&gt;854&lt;/web:BusinessID&gt;
  &lt;web:Email&gt;michael.hudson@emailreaction.org&lt;/web:Email&gt;
  &lt;web:DaytimeTelephoneNumber&gt;01778 852852&lt;/web:DaytimeTelephoneNumber&gt;
  &lt;web:HouseNumber&gt;Byways&lt;/web:HouseNumber&gt;
  &lt;web:Street1&gt;Rippons Drove&lt;/web:Street1&gt;
  &lt;web:Street2&gt;Northborough&lt;/web:Street2&gt;
  &lt;web:TownCity&gt;Peterborough&lt;/web:TownCity&gt;
  &lt;web:County&gt;Cambridgeshire&lt;/web:County&gt;
  &lt;web:Postcode&gt;PE6 9AG&lt;/web:Postcode&gt;
  &lt;web:IsSameAsRiskAddress&gt;0&lt;/web:IsSameAsRiskAddress&gt;
  &lt;web:PropertyHouseNumber&gt;2&lt;/web:PropertyHouseNumber&gt;
  &lt;web:PropertyStreet1&gt;Nevile Drive&lt;/web:PropertyStreet1&gt;
  &lt;web:PropertyStreet2&gt;Kinoulton&lt;/web:PropertyStreet2&gt;
  &lt;web:PropertyTownCity&gt;Nottingham&lt;/web:PropertyTownCity&gt;
  &lt;web:PropertyCounty&gt;Nottinghamshire&lt;/web:PropertyCounty&gt;
  &lt;web:PropertyPostcode&gt;NG12 3EE&lt;/web:PropertyPostcode&gt;
  &lt;web:IsJointApplicant&gt;1&lt;/web:IsJointApplicant&gt;
  &lt;web:SoleOccupancy originalvalueid="Proposer and lodgers"&gt;0&lt;/web:SoleOccupancy&gt;
  &lt;web:WhoElseLives originalvalueid="Proposer and lodgers"&gt;LOD01&lt;/web:WhoElseLives&gt;
  &lt;web:HaveConvictions&gt;0&lt;/web:HaveConvictions&gt;
  &lt;web:BankruptOrCCJOrIVA&gt;0&lt;/web:BankruptOrCCJOrIVA&gt;
  &lt;web:RefusedCancelled&gt;0&lt;/web:RefusedCancelled&gt;
  &lt;web:JointPolicyHolder&gt;
    &lt;web:JPTitleID&gt;002&lt;/web:JPTitleID&gt;
    &lt;web:JPFirstName&gt;Joint&lt;/web:JPFirstName&gt;
    &lt;web:JPLastName&gt;Policyholder&lt;/web:JPLastName&gt;
    &lt;web:JPDateOfBirth&gt;1960-01-01&lt;/web:JPDateOfBirth&gt;
    &lt;web:JPSex&gt;F&lt;/web:JPSex&gt;
    &lt;web:JPRelationshipID originalvalueid="Son/Daughter"&gt;4&lt;/web:JPRelationshipID&gt;
    &lt;web:JPOccupationID originalvalueid="Full Time Education"&gt;S34&lt;/web:JPOccupationID&gt;
    &lt;web:JPBusinessID originalvalueid="Full Time Education"&gt;186&lt;/web:JPBusinessID&gt;
  &lt;/web:JointPolicyHolder&gt;
  &lt;web:PreviouslyBoughtHomeInsurance&gt;1&lt;/web:PreviouslyBoughtHomeInsurance&gt;
  &lt;web:StartDate&gt;2014-10-30&lt;/web:StartDate&gt;
  &lt;web:CoverTypeID originalvalueid="Buildings &amp;amp; Contents Cover"&gt;1&lt;/web:CoverTypeID&gt;
  &lt;web:NumberOfYearsInsuranceHeld originalvalueid="2 years"&gt;2&lt;/web:NumberOfYearsInsuranceHeld&gt;
  &lt;web:PreviousClaims&gt;1&lt;/web:PreviousClaims&gt;
  &lt;web:Claim xmlns="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd"&gt;
    &lt;web:ClaimDate&gt;2010-10-01&lt;/web:ClaimDate&gt;
    &lt;web:ClaimAmount&gt;1000&lt;/web:ClaimAmount&gt;
    &lt;web:ClaimTypeID originalvalueid="theft"&gt;4A&lt;/web:ClaimTypeID&gt;
    &lt;web:ClaimSection&gt;3&lt;/web:ClaimSection&gt;
    &lt;web:ClaimAtCurrentProperty&gt;0&lt;/web:ClaimAtCurrentProperty&gt;
  &lt;/web:Claim&gt;
  &lt;web:HRI xmlns="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd"&gt;
    &lt;web:HRICategoryID originalvalueid="portable computers"&gt;P23&lt;/web:HRICategoryID&gt;
    &lt;web:HRIDescription&gt;HP Laptop&lt;/web:HRIDescription&gt;
    &lt;web:HRIValue&gt;1700&lt;/web:HRIValue&gt;
  &lt;/web:HRI&gt;
  &lt;web:PropertyTypeID originalvalueid="Semi-detached House"&gt;10&lt;/web:PropertyTypeID&gt;
  &lt;web:YearBuilt&gt;1982&lt;/web:YearBuilt&gt;
  &lt;web:Bedrooms originalvalueid="Two"&gt;2&lt;/web:Bedrooms&gt;
  &lt;web:WallConstructionID originalvalueid="Concrete"&gt;05&lt;/web:WallConstructionID&gt;
  &lt;web:RoofConstructionID originalvalueid="Asphalt"&gt;19&lt;/web:RoofConstructionID&gt;
  &lt;web:Roof33PercentFlat&gt;0&lt;/web:Roof33PercentFlat&gt;
  &lt;web:RoofThatched&gt;0&lt;/web:RoofThatched&gt;
  &lt;web:PropertyListed&gt;0&lt;/web:PropertyListed&gt;
  &lt;web:SignsOfSubsidence&gt;1&lt;/web:SignsOfSubsidence&gt;
  &lt;web:YearOfSubsidence&gt;2006&lt;/web:YearOfSubsidence&gt;
  &lt;web:OnlySubsidenceIncident&gt;1&lt;/web:OnlySubsidenceIncident&gt;
  &lt;web:SubsidenceCauseTypeID&gt;DRA02&lt;/web:SubsidenceCauseTypeID&gt;
  &lt;web:SubsidenceMainPropertyAffected&gt;1&lt;/web:SubsidenceMainPropertyAffected&gt;
  &lt;web:SubsidenceInNeighbourhood&gt;0&lt;/web:SubsidenceInNeighbourhood&gt;
  &lt;web:IssueRectified&gt;1&lt;/web:IssueRectified&gt;
  &lt;web:IssueRectified&gt;0&lt;/web:IssueRectified&gt;
  &lt;web:underpinned&gt;0&lt;/web:underpinned&gt;
  &lt;web:GoodStateOfRepair&gt;1&lt;/web:GoodStateOfRepair&gt;
  &lt;web:OwnershipTypeID originalvalueid="Renting - Private - Furnished"&gt;RPL01&lt;/web:OwnershipTypeID&gt;
  &lt;web:OccupiedWhenID originalvalueid="Occupied Day and Night"&gt;OCC03&lt;/web:OccupiedWhenID&gt;
  &lt;web:ConsecutiveDaysUnoccupiedID originalvalueid="Up to 45"&gt;30&lt;/web:ConsecutiveDaysUnoccupiedID&gt;
  &lt;web:DomesticUseOnly originalvalueid="Children minded at property"&gt;0&lt;/web:DomesticUseOnly&gt;
  &lt;web:FrequencyOfVisitor&gt;1&lt;/web:FrequencyOfVisitor&gt;
  &lt;web:HowManyAtOneTime&gt;99&lt;/web:HowManyAtOneTime&gt;
  &lt;web:MainIncome&gt;1&lt;/web:MainIncome&gt;
  &lt;web:OfficeSelfContained&gt;0&lt;/web:OfficeSelfContained&gt;
  &lt;web:CommercialInsurance&gt;0&lt;/web:CommercialInsurance&gt;
  &lt;web:NumStaffEmployed&gt;1&lt;/web:NumStaffEmployed&gt;
  &lt;web:EmployersLiabilityInsurance&gt;1&lt;/web:EmployersLiabilityInsurance&gt;
  &lt;web:EscortedOnAndOff&gt;1&lt;/web:EscortedOnAndOff&gt;
  &lt;web:BusinessEquipmentCoverRequired&gt;0&lt;/web:BusinessEquipmentCoverRequired&gt;
  &lt;web:BusinessStockAtProperty&gt;0&lt;/web:BusinessStockAtProperty&gt;
  &lt;web:PropertyUseType&gt;WED01&lt;/web:PropertyUseType&gt;
  &lt;web:MainLocksID originalvalueid="UPVC or aluminium door with multi-point locking system"&gt;3&lt;/web:MainLocksID&gt;
  &lt;web:PatioLocksID originalvalueid="Key to lock from outside - unlock &amp;amp; pull down lever to re-enter"&gt;3&lt;/web:PatioLocksID&gt;
  &lt;web:OtherLocksID originalvalueid="UPVC or aluminium doors with key-operated multi-point lock"&gt;3&lt;/web:OtherLocksID&gt;
  &lt;web:KeyOperatedWindows&gt;1&lt;/web:KeyOperatedWindows&gt;
  &lt;web:BurglarAlarm&gt;1&lt;/web:BurglarAlarm&gt;
  &lt;web:NACOSSApproved&gt;1&lt;/web:NACOSSApproved&gt;
  &lt;web:AlarmMonitored&gt;1&lt;/web:AlarmMonitored&gt;
  &lt;web:Safe&gt;1&lt;/web:Safe&gt;
  &lt;web:SmokeAlarm&gt;1&lt;/web:SmokeAlarm&gt;
  &lt;web:Within200mWater&gt;0&lt;/web:Within200mWater&gt;
  &lt;web:BuildingsSumInsured&gt;100000&lt;/web:BuildingsSumInsured&gt;
  &lt;web:BuildingsAccidentalDamage&gt;0&lt;/web:BuildingsAccidentalDamage&gt;
  &lt;web:BuildingsVolExcess originalvalueid="100"&gt;100&lt;/web:BuildingsVolExcess&gt;
  &lt;web:ContentsSumInsured&gt;99000&lt;/web:ContentsSumInsured&gt;
  &lt;web:ContentsAccidentalDamage&gt;0&lt;/web:ContentsAccidentalDamage&gt;
  &lt;web:ContentsVolExcess originalvalueid="100"&gt;100&lt;/web:ContentsVolExcess&gt;
  &lt;web:UnspecifiedAwayFromHome&gt;20000&lt;/web:UnspecifiedAwayFromHome&gt;
&lt;/web:QuestionData&gt;</tem:quotationDataXml>
    </tem:GetQuote>
  </soap:Body>
</soap:Envelope>